package com.OOP;

/*
    1、JVM Java虚拟机 里面有三块内存空间，分别是：堆内存，栈内存，方法区内存
    2、堆内存和方法区内存各有一个，一个线程一个栈内存
    3、方法在调用的时候，压栈，方法执行结束，弹栈
    4、栈中主要存储的是局部变量
    5、方法的代码片段以及整个类的代码都存储在方法去内存，在类加载的时候进行载入
    6。使用 new 操作符创建的对象，存储在堆中，对象内部的变量叫做实例变量，实例变量存储在堆中
    7、变量分类：
        - 局部变量 方法体中声明

        - 成员变量 方法提外声明
            - 实例变量 修饰符前面没有 static 对象里面的变量叫做成员变量中的实例变量
            - 静态变量 修饰符有 static

    8、静态变量存储在方法区内存中
    9、变化最频繁的是栈内存、最先有数据的是方法区内存、垃圾回收器针对的是堆内存

    10、垃圾回收器 ，什么时候进行回收呢？
        - 当堆内存中的东西变成垃圾的时候会被回收
        - 什么时候堆内存中的 Java 对象会变成垃圾呢？
            - 没有更多的引用指向它的时候，只要有其它的对象指向它，它还有用就不会被回收
 */

public class Java内存分析 {
}
