package com.day01_06;

public class MethHoodTest {
    public static void main(String[] args){

    }

    /*
        方法中的修饰符 返回值列表 方法名字 里面的参数

        对语法结构进行一定的说明

        public static 目前统一写
        static 方法的调用

        类明. 类明的方法

        返回值类型
            什么是返回值 函数方法的最终成果的返回值 运行结束 看返回的方法
            返回的东西有自己的类型也就是有返回值类型
            如果返回值什么也不返回 返回值类型写成 void 就行
            返回值的数据类型和方法的返回值类型已知 否则编译器将会报错
            当函数声明的时候写了 void 那就不能写返回值了 对应着写即可
            只要遇到 return 方法将会被强行停止 不是 JVM 结束 而是方法结束了

        形式参数 实际参数 方法体由大括号进行括起来 形式参数 它的值 会随着传入的具体值会发生变化
        形式参数重重要的是数据类型 变量的名称不重要

        方法的调用 方法的名字 加上 传进去的参数
        或者没有参数 直接使用名字调用即可

        给予函数一个东西 拿到相关的原料进行操作出处理 得到想得到的东西 也就是得到返回值

        在 Java 文件中 一般只有在一个文件中写一个类就可以了 良好的习惯

        观察 抽象 做成类 类示例化形成对象

    */

    public static void test(){

    }
}
