package com.基础课程代码练习.day01_06;
// 变量的作用域
// 类体中不能 编写语句
// 除了一个特定的位置之后 在其他的位置 就是不承认的

// 数据类型 分配内存中的空间
// 基本数据类型
// 引用数据类型

// 计算机表示现实世界中的文字
// 底层是 1010101000100011100011001001010
// 文字与二进制之间的相互转换
// 制定文字与二进制之间的关系
// 创造出来了编码进行解决这个问题
// 编码与解码之间需要一致的 否则会出现乱码的现象

// 编码 解码 之间的规则需要搞清楚

// 后来的全球出项了一种全球通用的编码方式叫做 unicode 容量是比较大的
// unicode 采用了多种的具体实现 其中有下面几种方式

// java 采用 unicode 可以使用中文标识符
//  - UTF -8；  UTF- 16；  UTF - 32；
// UTF - 8 的编码方式
// 自符编码

public class 作用域 {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
