package com.基础课程代码练习.Super;

/**
 *  super 是一个关键字，全部小写，
 *      this 只能出现在实例方法中和构造方法中
 *      this 的用法是："this." "this()"
 *      this 不能使用在静态的方法中
 *      this. 大部分的情况下是可以省略的
 *      this. 什么时候 不能省略？
 *          区分实例变量与局部变量的时候
 *
 *          局部变量：定义在了方法体的内部，当方法执行结束的时候，当函数执行结束，局部变量周期结束了
 *
 *          this 指向当前对象，使用类进行对象的创建的时候，每个对象都是会有类里面的方法的，创建出来的类，使用自己的方法使用 this 表示
 *               比如：创建的一个动物的实例（对象），吃饭使用自己的嘴，而不是其他实例的嘴；this 在类的内部，表示创建出来的对象，使用自己的
 *               器官，自己的方法，所有的操作都是自己调用的，自己执行，自己得到执行结果；
 */
public class Super {
}
